package com.bankapp.app.enums;

/**
 * платежная система
 */
public enum PaymentSystem {
    VISA, //Одна из крупнейших мировых платежных систем, предоставляющая кредитные и дебетовые карты, которые принимаются в миллионах мест по всему миру.
    MASTERCARD, // Еще одна крупная платежная система, предоставляющая кредитные и дебетовые карты, также широко распространена во всем мире.
    AMERICAN_EXPRESS, // Платежная система, известная своими кредитными картами и услугами для высоко-доходных клиентов.
    PAYPAL, // Электронная платежная система, предоставляющая услуги онлайн-платежей и денежных переводов.
    APPLE_PAY, // Мобильная платежная система, разработанная Apple, позволяющая пользователям совершать платежи через свои устройства.
    GOOGLE_PAY, // Мобильная платежная система от Google, предоставляющая аналогичные услуги для пользователей Android-устройств.
    SEPA // (Single Euro Payments Area): Европейская система платежей в евро, облегчающая граничные банковские операции в еврозоне.
}